Revit 2027 API
BendingDetailPositionOptions Enumeration
 An enumerated type listing the bending detail position options supported by the Bending Detail.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public enum BendingDetailPositionOptions
Public Enumeration BendingDetailPositionOptions
public enum class BendingDetailPositionOptions
type BendingDetailPositionOptions
Members
Member name | Value | Description
Bottom | 3 |  The bending detail position is at the bottom of the Bending Detial.
Left | 1 |  The bending detail position is at the left of the Bending Detial.
Right | 0 |  The bending detail position is at the right of the Bending Detial.
Top | 2 |  The bending detail position is at the top of the Bending Detial.
See Also
Reference
Autodesk.Revit.DB Namespace